# üêº Python Pandas Practice Exercises
- Learnning and mastering Python's powerful data manipulation library ‚Äî Pandas.

- This notebook contains a series of progressively challenging exercises (with real-world context) to help you become a Pandas pro.


## üìò Instructions followed:
- Read the problem description carefully.
- Tried to solve the exercises using **Pythonic and efficient Pandas operations**.
- Did **not** use any external libraries unless specified.

Let's begin!

In [29]:
import pandas as pd
import matplotlib.pyplot as plt

### 1. Create a Pandas Series from a Python list `[10, 20, 30, 40, 50]`.

In [30]:
li = [10, 20, 30, 40, 50]
ps = pd.Series(li)
ps

0    10
1    20
2    30
3    40
4    50
dtype: int64

### 2. Create a Series with custom index labels using `[100, 200, 300]` and labels `['a', 'b', 'c']`.

In [31]:
ps = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
ps

a    100
b    200
c    300
dtype: int64

### 3. Retrieve the 2nd and 3rd elements from a Series.

In [32]:
ps.iloc[[1, 2]]

b    200
c    300
dtype: int64

### 4. Add two Series element-wise.

In [33]:
ps1 = pd.Series([1, 2, 3])
ps2 = pd.Series([4, 5, 6])
added_ps = ps1 + ps2
added_ps

0    5
1    7
2    9
dtype: int64

### 5. Apply a lambda function to square each element of a numeric Series.

In [34]:
ps = pd.Series([1, 2, 3])
squared  = ps.apply(lambda x: x ** 2)
squared

0    1
1    4
2    9
dtype: int64

### 6. Create a Pandas DataFrame from a dictionary with columns: Name, Age, and City.

In [35]:
people = {
    'id' : [1, 2, 3, 4, 5, 6],
    'name': ['Asif', 'Babu', 'Emon', 'Hassan', 'Mazid', 'Shiraj'],
    'age' : [19, 27, 23, 30, 17, None],
    'city' : ['shylet', 'noakhali', 'dhaka', 'noakhali', 'dhaka', 'shylet']
}

df = pd.DataFrame(people)
df

   id    name   age      city
0   1    Asif  19.0    shylet
1   2    Babu  27.0  noakhali
2   3    Emon  23.0     dhaka
3   4  Hassan  30.0  noakhali
4   5   Mazid  17.0     dhaka
5   6  Shiraj   NaN    shylet

### 7. Retrieve the first 3 rows of a DataFrame.

In [36]:
df.iloc[:3]

   id  name   age      city
0   1  Asif  19.0    shylet
1   2  Babu  27.0  noakhali
2   3  Emon  23.0     dhaka

### 8. Select only the 'Name' and 'City' columns from the DataFrame.

In [37]:
df[['name', 'city']]

     name      city
0    Asif    shylet
1    Babu  noakhali
2    Emon     dhaka
3  Hassan  noakhali
4   Mazid     dhaka
5  Shiraj    shylet

### 9. Filter all rows where age is above 25.

In [38]:
df[df['age'] > 25]

   id    name   age      city
1   2    Babu  27.0  noakhali
3   4  Hassan  30.0  noakhali

### 10. Add a new column 'Salary' with values `[50000, 60000, 70000]`.

In [39]:
salary = [50000, 60000, 70000, 80000, 20000, None]
df['salary'] = salary
df

   id    name   age      city   salary
0   1    Asif  19.0    shylet  50000.0
1   2    Babu  27.0  noakhali  60000.0
2   3    Emon  23.0     dhaka  70000.0
3   4  Hassan  30.0  noakhali  80000.0
4   5   Mazid  17.0     dhaka  20000.0
5   6  Shiraj   NaN    shylet      NaN

### 11. Sort the DataFrame by 'Age' in descending order.

In [40]:
df.sort_values('age')

   id    name   age      city   salary
4   5   Mazid  17.0     dhaka  20000.0
0   1    Asif  19.0    shylet  50000.0
2   3    Emon  23.0     dhaka  70000.0
1   2    Babu  27.0  noakhali  60000.0
3   4  Hassan  30.0  noakhali  80000.0
5   6  Shiraj   NaN    shylet      NaN

### 12. Reset the index of a DataFrame.

In [41]:
df.reset_index()

   index  id    name   age      city   salary
0      0   1    Asif  19.0    shylet  50000.0
1      1   2    Babu  27.0  noakhali  60000.0
2      2   3    Emon  23.0     dhaka  70000.0
3      3   4  Hassan  30.0  noakhali  80000.0
4      4   5   Mazid  17.0     dhaka  20000.0
5      5   6  Shiraj   NaN    shylet      NaN

### 13. Set the 'Name' column as index.

In [42]:
df.index = df['name']

In [43]:
df

        id    name   age      city   salary
name
Asif     1    Asif  19.0    shylet  50000.0
Babu     2    Babu  27.0  noakhali  60000.0
Emon     3    Emon  23.0     dhaka  70000.0
Hassan   4  Hassan  30.0  noakhali  80000.0
Mazid    5   Mazid  17.0     dhaka  20000.0
Shiraj   6  Shiraj   NaN    shylet      NaN

In [44]:
df.drop('name', axis=1, inplace= True)

### 14. Filter rows where 'City' is either 'Noakhlali' or 'Shylet'.

In [45]:
df[(df['city'] == 'noakhali') | (df['city'] == 'barishal')]

        id   age      city   salary
name
Babu     2  27.0  noakhali  60000.0
Hassan   4  30.0  noakhali  80000.0

### 15. Replace missing values in a DataFrame with the column mean.

In [46]:
df['age'].fillna(value= df['age'].mean(), inplace= True)

C:\Users\Babu\AppData\Local\Temp\ipykernel_21544\2561101249.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(value= df['age'].mean(), inplace= True)

In [47]:
df['salary'].fillna(value= df['salary'].mean(), inplace= True)

C:\Users\Babu\AppData\Local\Temp\ipykernel_21544\126905080.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(value= df['salary'].mean(), inplace= True)

In [48]:
df

        id   age      city   salary
name
Asif     1  19.0    shylet  50000.0
Babu     2  27.0  noakhali  60000.0
Emon     3  23.0     dhaka  70000.0
Hassan   4  30.0  noakhali  80000.0
Mazid    5  17.0     dhaka  20000.0
Shiraj   6  23.2    shylet  56000.0

### 16. Group the DataFrame by 'City' and compute average 'Salary'.

In [49]:
avg_salary_by_city = df.groupby('city')['salary'].mean().reset_index()
avg_salary_by_city

       city   salary
0     dhaka  45000.0
1  noakhali  70000.0
2    shylet  53000.0

### 17. Use `apply()` to calculate the length of each name in 'Name' column.

In [50]:
df.reset_index(inplace= True)

In [51]:
df['name_length'] = df['name'].apply(lambda x: len(x))

In [52]:
df

     name  id   age      city   salary  name_length
0    Asif   1  19.0    shylet  50000.0            4
1    Babu   2  27.0  noakhali  60000.0            4
2    Emon   3  23.0     dhaka  70000.0            4
3  Hassan   4  30.0  noakhali  80000.0            6
4   Mazid   5  17.0     dhaka  20000.0            5
5  Shiraj   6  23.2    shylet  56000.0            6

### 18. Add a new column 'Tax' that is 10% of the Salary using `apply()`.

In [53]:
df['tax'] = df['salary'].apply(lambda x: x * .1)
df

     name  id   age      city   salary  name_length     tax
0    Asif   1  19.0    shylet  50000.0            4  5000.0
1    Babu   2  27.0  noakhali  60000.0            4  6000.0
2    Emon   3  23.0     dhaka  70000.0            4  7000.0
3  Hassan   4  30.0  noakhali  80000.0            6  8000.0
4   Mazid   5  17.0     dhaka  20000.0            5  2000.0
5  Shiraj   6  23.2    shylet  56000.0            6  5600.0

### 19. Filter groups with more than 1 entry using `groupby`.

### 20. Create a pivot table of average Salary by City and Age.

In [54]:
salary_pivot_table = pd.pivot_table(df, values='salary', index= 'age', columns='city', aggfunc='mean', fill_value='-')
salary_pivot_table

city    dhaka noakhali   shylet
age
17.0  20000.0        -        -
19.0        -        -  50000.0
23.0  70000.0        -        -
23.2        -        -  56000.0
27.0        -  60000.0        -
30.0        -  80000.0        -

### 21. Merge two DataFrames on a common column 'ID'.

In [58]:
sales_data = {
    'id' : [1, 2, 3, 4, 5, 6],
    'branch' : ['uttara', 'jamuna', 'jamuna', 'bashundara', 'uttara', 'bashundara'],
    'sales' : [1300000, 3000000, 3700000, 2000000, 700000, 1500000],
    'kpi' : [70, 90, 88, 83, 65, 76]
}

sales_df = pd.DataFrame(sales_data)
sales_df

   id      branch    sales  kpi
0   1      uttara  1300000   70
1   2      jamuna  3000000   90
2   3      jamuna  3700000   88
3   4  bashundara  2000000   83
4   5      uttara   700000   65
5   6  bashundara  1500000   76

In [60]:
marged_df = df.merge(sales_df, on='id', how='inner')
marged_df

,name,id,age,city,salary,name_length,tax,branch,sales,kpi
0,Asif,1,19.0,shylet,50000.0,4,5000.0,uttara,1300000,70
1,Babu,2,27.0,noakhali,60000.0,4,6000.0,jamuna,3000000,90
2,Emon,3,23.0,dhaka,70000.0,4,7000.0,jamuna,3700000,88
3,Hassan,4,30.0,noakhali,80000.0,6,8000.0,bashundara,2000000,83
4,Mazid,5,17.0,dhaka,20000.0,5,2000.0,uttara,700000,65
5,Shiraj,6,23.2,shylet,56000.0,6,5600.0,bashundara,1500000,76

### 22. Perform a left join using Pandas.

In [66]:
left_joined_df = df.join(sales_df.set_index('id'), on='id', how='left')
left_joined_df

,name,id,age,city,salary,name_length,tax,branch,sales,kpi
0,Asif,1,19.0,shylet,50000.0,4,5000.0,uttara,1300000,70
1,Babu,2,27.0,noakhali,60000.0,4,6000.0,jamuna,3000000,90
2,Emon,3,23.0,dhaka,70000.0,4,7000.0,jamuna,3700000,88
3,Hassan,4,30.0,noakhali,80000.0,6,8000.0,bashundara,2000000,83
4,Mazid,5,17.0,dhaka,20000.0,5,2000.0,uttara,700000,65
5,Shiraj,6,23.2,shylet,56000.0,6,5600.0,bashundara,1500000,76

### 23. Concatenate two DataFrames vertically (stack rows).

In [68]:
jan_sales = pd.DataFrame({  # This random data is generated by Deepseek
    'order_id': ['JAN001', 'JAN002'],
    'customer': ['Alice', 'Bob'],
    'amount': [150.50, 200.75],
    'date': ['2023-01-15', '2023-01-20']
})

feb_sales = pd.DataFrame({
    'order_id': ['FEB001', 'FEB002'],
    'customer': ['Charlie', 'Alice'],
    'amount': [300.20, 175.90],
    'date': ['2023-02-05', '2023-02-12']
})

all_sales = pd.concat([jan_sales, feb_sales], axis=0, ignore_index=True, sort=False)
all_sales

  order_id customer  amount        date
0   JAN001    Alice  150.50  2023-01-15
1   JAN002      Bob  200.75  2023-01-20
2   FEB001  Charlie  300.20  2023-02-05
3   FEB002    Alice  175.90  2023-02-12

### 24. Concatenate two DataFrames horizontally (side-by-side).

In [69]:
customer_info = pd.DataFrame({
    'customer_id': [101, 102, 103],
    'name': ['Alice', 'Bob', 'Charlie'],
    'join_date': ['2022-01-15', '2021-11-03', '2023-02-20']
})
order_stats = pd.DataFrame({
    'total_orders': [15, 8, 23],
    'avg_order_value': [85.50, 120.75, 65.20]
})

customer_df = pd.concat([customer_info, order_stats], axis=1, sort=False)
customer_df

   customer_id     name   join_date  total_orders  avg_order_value
0          101    Alice  2022-01-15            15            85.50
1          102      Bob  2021-11-03             8           120.75
2          103  Charlie  2023-02-20            23            65.20

### 25. Join two DataFrames with different column names but similar data using `left_on` and `right_on`.

In [70]:
customers = pd.DataFrame({
    'customer_id': [101, 102, 103],
    'name': ['Alice', 'Bob', 'Charlie'],
    'email': ['alice@example.com', 'bob@example.com', 'charlie@example.com']
})
orders = pd.DataFrame({
    'client_id': [101, 103, 104],  # Note: 104 doesn't exist in customers
    'order_total': [85.50, 120.75, 65.20],
    'order_date': ['2023-01-15', '2023-02-20', '2023-03-10']
})

marged_df = pd.merge(customers, orders, left_on='customer_id', right_on='client_id', how='left')
marged_df

,customer_id,name,email,client_id,order_total,order_date
0,101,Alice,alice@example.com,101.0,85.50,2023-01-15
1,102,Bob,bob@example.com,NaN,NaN,NaN
2,103,Charlie,charlie@example.com,103.0,120.75,2023-02-20

### 26. Load a CSV file into a Pandas DataFrame (e.g., 'sales.csv').

In [79]:
data = pd.read_csv('data/sales_data.csv')
df = data.copy()
df.head()

,OrderID,CustomerID,OrderDate,Country,Category,Product,Quantity,UnitPrice,TotalPrice,Discount,Revenue,PaymentMethod
0,100000,1860,2023-04-12,India,Sports,Treadmill,8,301.34,2410.72,0.00,2410.72,Bank Transfer
1,100001,9322,2024-03-16,Australia,Home & Kitchen,Vacuum Cleaner,5,485.11,2425.55,242.56,2182.99,PayPal
2,100002,7420,2023-04-20,USA,Groceries,Vegetables,6,8.50,51.00,0.00,51.00,Bank Transfer
3,100003,3047,2023-10-09,Germany,Sports,Tennis Racket,3,194.32,582.96,87.44,495.52,Credit Card
4,100004,6393,2024-02-16,Germany,Electronics,Headphones,9,482.99,4346.91,434.69,3912.22,PayPal

In [80]:
df.shape

(10000, 12)

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderID        10000 non-null  int64
 1   CustomerID     10000 non-null  int64
 2   OrderDate      10000 non-null  object
 3   Country        10000 non-null  object
 4   Category       10000 non-null  object
 5   Product        10000 non-null  object
 6   Quantity       10000 non-null  int64
 7   UnitPrice      10000 non-null  float64
 8   TotalPrice     10000 non-null  float64
 9   Discount       10000 non-null  float64
 10  Revenue        10000 non-null  float64
 11  PaymentMethod  10000 non-null  object
dtypes: float64(4), int64(3), object(5)
memory usage: 937.6+ KB

In [82]:
df.describe()

,OrderID,CustomerID,Quantity,UnitPrice,TotalPrice,Discount,Revenue
count,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,104999.50000,5526.033100,5.018300,253.061813,1267.417835,40.240877,1227.176958
std,2886.89568,2601.716655,2.575001,142.777077,1026.915281,81.749290,996.070540
min,100000.00000,1000.000000,1.000000,5.020000,5.250000,0.000000,4.990000
25%,102499.75000,3265.750000,3.000000,130.060000,416.090000,0.000000,402.630000
50%,104999.50000,5576.000000,5.000000,254.045000,988.325000,0.000000,956.340000
75%,107499.25000,7771.000000,7.000000,377.195000,1906.890000,44.362500,1846.272500
max,109999.00000,9998.000000,9.000000,499.950000,4495.590000,660.690000,4495.590000

### 27. Find top 5 products with highest total sales from the sales data.

In [90]:
top_5_products = df.groupby('Product')['TotalPrice'].sum().reset_index().sort_values('TotalPrice', ascending=False).head(5)
top_5_products

           Product  TotalPrice
29  Vacuum Cleaner   446392.39
10          Laptop   424211.12
2             Doll   422633.49
22         Shampoo   419381.16
17           Novel   417896.36

### 28. Convert a date column to datetime and extract the year.

In [ ]:
df['OrderDate'] = pd.to_datetime(df['OrderDate'])

In [93]:
df['year'] = df['OrderDate'].dt.year

In [95]:
df.head()

,OrderID,CustomerID,OrderDate,Country,Category,Product,Quantity,UnitPrice,TotalPrice,Discount,Revenue,PaymentMethod,year
0,100000,1860,2023-04-12,India,Sports,Treadmill,8,301.34,2410.72,0.00,2410.72,Bank Transfer,2023
1,100001,9322,2024-03-16,Australia,Home & Kitchen,Vacuum Cleaner,5,485.11,2425.55,242.56,2182.99,PayPal,2024
2,100002,7420,2023-04-20,USA,Groceries,Vegetables,6,8.50,51.00,0.00,51.00,Bank Transfer,2023
3,100003,3047,2023-10-09,Germany,Sports,Tennis Racket,3,194.32,582.96,87.44,495.52,Credit Card,2023
4,100004,6393,2024-02-16,Germany,Electronics,Headphones,9,482.99,4346.91,434.69,3912.22,PayPal,2024

### 29. Create a rolling average column for 'Sales' with a window of 3.

In [97]:
df['Rolling_Avg_Revenue'] = round(df['Revenue'].rolling(window=3, min_periods=1).mean(), 2)
df.head()

,OrderID,CustomerID,OrderDate,Country,Category,Product,Quantity,UnitPrice,TotalPrice,Discount,Revenue,PaymentMethod,year,Rolling_Avg_Revenue
0,100000,1860,2023-04-12,India,Sports,Treadmill,8,301.34,2410.72,0.00,2410.72,Bank Transfer,2023,2410.72
1,100001,9322,2024-03-16,Australia,Home & Kitchen,Vacuum Cleaner,5,485.11,2425.55,242.56,2182.99,PayPal,2024,2296.85
2,100002,7420,2023-04-20,USA,Groceries,Vegetables,6,8.50,51.00,0.00,51.00,Bank Transfer,2023,1548.24
3,100003,3047,2023-10-09,Germany,Sports,Tennis Racket,3,194.32,582.96,87.44,495.52,Credit Card,2023,909.84
4,100004,6393,2024-02-16,Germany,Electronics,Headphones,9,482.99,4346.91,434.69,3912.22,PayPal,2024,1486.25

### 30. Identify and drop duplicate rows based on 'Order ID'.

In [104]:
df.duplicated(subset=['OrderID']).any()

np.False_

In [105]:
df.drop_duplicates(subset=['OrderID'], keep='first')

,OrderID,CustomerID,OrderDate,Country,Category,Product,Quantity,UnitPrice,TotalPrice,Discount,Revenue,PaymentMethod,year,Rolling_Avg_Revenue
0,100000,1860,2023-04-12,India,Sports,Treadmill,8,301.34,2410.72,0.00,2410.72,Bank Transfer,2023,2410.72
1,100001,9322,2024-03-16,Australia,Home & Kitchen,Vacuum Cleaner,5,485.11,2425.55,242.56,2182.99,PayPal,2024,2296.85
2,100002,7420,2023-04-20,USA,Groceries,Vegetables,6,8.50,51.00,0.00,51.00,Bank Transfer,2023,1548.24
3,100003,3047,2023-10-09,Germany,Sports,Tennis Racket,3,194.32,582.96,87.44,495.52,Credit Card,2023,909.84
4,100004,6393,2024-02-16,Germany,Electronics,Headphones,9,482.99,4346.91,434.69,3912.22,PayPal,2024,1486.25
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,109995,3438,2023-05-10,Germany,Clothing,Dress,6,173.05,1038.30,51.92,986.38,PayPal,2023,604.22
9996,109996,4297,2023-04-11,USA,Electronics,Smartphone,2,261.87,523.74,26.19,497.55,Bank Transfer,2023,602.96
9997,109997,9887,2023-10-17,Canada,Clothing,Dress,1,237.19,237.19,11.86,225.33,PayPal,2023,569.75
9998,109998,1253,2024-02-18,Germany,Beauty,Face Cream,9,19.84,178.56,8.93,169.63,Credit Card,2024,297.50
9999,109999,9261,2022-05-21,India,Home & Kitchen,Cookware Set,3,292.73,878.19,43.91,834.28,PayPal,2022,409.75